Revit 2027 API
ParameterTypeId.ElemRoomId Property
 "Room Id"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ElemRoomId { get; }
Public Shared ReadOnly Property ElemRoomId As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ElemRoomId {
	ForgeTypeId^ get ();
}
static member ElemRoomId : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace